welcome_message = """
🔗 Welcome to Matcher! 🌐

Welcome to Matcher, your ultimate Web3 networking app! 🚀

Here, you can swipe to like or dislike profiles based on both their detailed information and on-chain hard-skills verification. Say goodbye to networking fears and hello to genuine connections! 🌟

Whether you're seeking new partners, friends, or collaborators in the Web3 space, Matcher provides a safe and authentic environment to connect with other builders.

Start swiping, chatting, and meeting your perfect match today. Happy networking! ✨
"""

welcome_message_ru = """
🔗 Добро пожаловать в Matcher! 🌐

Добро пожаловать в Matcher, ваше идеальное приложение для нетворкинга в Web3! 🚀

Здесь вы можете свайпать, лайкать или дизлайкать профили, основываясь на их детальной информации и скоринге активности на блокчейне. Попрощайтесь со страхами нетворкинга и скажите привет новым связям! 🌟

Ищете ли вы новых партнеров, друзей или соратников в мире Web3, Matcher предоставляет безопасную и аутентичную среду для общения с другими пользователями.

Начните свайпать, общаться и находить свою идеальную пару уже сегодня. Удачного нетворкинга! ✨
"""

welcome_message_ua = """
🔗 Ласкаво просимо до Matcher! 🌐

Ласкаво просимо до Matcher, вашого ідеального додатку для нетворкінгу в Web3! 🚀

Тут ви можете свайпати, лайкати або дизлайкати профілі, базуючись на їхній детальній інформації та скорингу активності на блокчейні. Попрощайтеся зі страхами нетворкінгу та скажіть привіт новим зв'язкам! 🌟

Шукаєте нових партнерів, друзів або соратників у світі Web3, Matcher надає безпечне та автентичне середовище для спілкування з іншими користувачами.

Почніть свайпати, спілкуватися та знаходити свою ідеальну пару вже сьогодні. Успішного нетворкінгу! ✨"""

new_match = """New match found!  
   🎉 Congratulations! You have a new match. Check your match list to see who it is.
"""

new_match_ru = """New Match!
   🎉 Поздравляем! У вас новый мэтч! Зайдите в приложение чтобы сразу начать нетворкинг.
"""

new_match_uk = """New Match!
   🎉 Вітаємо! У вас новий метч! Зайдіть у застосунок щоб одразу почати нетворкінг."""

new_message = "New message from {username}\n💬 You have a new message from {username}. Open the chat to read it."

new_message_ru = "💬 У вас одно новое сообщение от {username}!"

new_message_uk = "💬 У вас одне нове повідомлення від {username}!"

profile_like = "Someone likes your profile!\n👍 {username} liked your profile. Check out their profile to like back."

profile_like_ru = "Кому-то понравился ваш профиль!\n👍 {username} понравился ваш профиль. Посмотрите их профиль, чтобы лайкнуть в ответ."

profile_like_uk = "Комусь сподобався ваш профіль!\n👍 {username} сподобався ваш профіль. Подивіться їхній профіль, щоб лайкнути у відповідь."

new_profiles = """Check out new profiles  
   🚀 New users have joined Matcher. Browse their profiles – you might find your ideal match among them."""

choose_language = """🔗 Welcome to Matcher! 🌐

🌍 Choose your language:"""

ref_link_ru = """💰Твоя реферальная ссылка:

{url}

Поделитесь ею с друзьями, коллегами и в социальных сетях, чтобы начать накапливать монеты прямо сейчас!👥"""

ref_link_uk = """💰Твоє реферальне посилання:

{url}

Поділіться ним із друзями, колегами та в соціальних мережах, щоб почати накопичувати монети просто зараз!👥"""

ref_link_en = """💰Your referral link:

{url}

Share it with your friends, coworkers and on social media to start accumulating coins now! 👥"""

ref_screen_ru = """🔗 Присоединяйтесь к нашей реферальной системе и зарабатывайте монеты! 💰

Мы рады представить вам нашу реферальную систему, которая поможет вам накапливать монеты, приглашая своих друзей и коллег в Matcher. Это отличная возможность не только расширить свою сеть контактов в Web3, но и заработать дополнительные бонусы за свою активность!"""

ref_screen_en = """🔗 Join our referral system and earn coins! 💰

We are pleased to introduce you to our referral system, which will help you accumulate coins by inviting your friends and colleagues to Matcher. This is a great opportunity to not only expand your network of contacts in Web3, but also earn extra bonuses for your activity!"""

ref_screen_uk = """🔗 Приєднуйтесь до нашої реферальної системи і заробляйте монети! 💰

Ми раді представити вам нашу реферальну систему, яка допоможе вам накопичувати монети, запрошуючи своїх друзів і колег у Matcher. Це чудова можливість не тільки розширити свою мережу контактів у Web3, а й заробити додаткові бонуси за свою активність!"""

ref_friends = """Самые активные друзья:

{friends}"""

ref_message_ru = """Кажется, кто-то присоединился по твоей реферальной ссылке! 🫂

Поздравляю! Ты заработал 500 монет за привлечение друга! 🎉

Продолжай приглашать друзей и расширять свой нетворкинг! 🙌"""

ref_message_en = """Looks like someone joined using your referral link! 🫂

Congrats! You've earned 500 coins for bringing a friend! 🎉

Keep inviting friends and expanding your network! 🙌"""

ref_message_uk = """Здається, хтось приєднався за твоїм реферальним посиланням! 🫂

Вітаємо! Ти заробив [Number] монет за те, що привів друга! 🎉

Продовжуй запрошувати друзів та розширювати свою мережу! 🙌"""

not_reg_en = """Oops! 🙈 It looks like you're not registered in the system yet. Please sign up first to create a referral link. ✍️"""

not_reg_uk = """Ой! 🙈 Здається, ти ще не зареєстрований у системі. Будь ласка, зареєструйся спочатку, щоб створити реферальне посилання. ✍️"""

not_reg_ru = """Упс! 🙈 Кажется, вы еще не зарегистрированы в системе. Пожалуйста, зарегистрируйтесь сначала, чтобы создать реферальную ссылку. ✍️"""
